etc/OpenFOAM_sample_files/outdoor_airflow_2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		controlDict;
}

#include		"probes";

application		simpleFoam;

startFrom		latestTime;

startTime		0;

stopAt		endTime;

endTime		5000;

deltaT		1;

writeControl		timeStep;

writeInterval		100;

purgeWrite		0;

writeFormat		ascii;

writePrecision		7;

writeCompression		off;

timeFormat		general;

timePrecision		6;

runTimeModifiable		true;

functions{}