etc/OpenFOAM_sample_files/outdoor_airflow_2d/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(20.216954406171141 -12.130292415618896 0.0)
	(21.216954406171141 -12.130292415618896 0.0)
	(21.216954406171141 139.49590752395216 0.0)
	(20.216954406171141 139.49590752395216 0.0)
	(20.216954406171141 -12.130292415618896 21.189438343048096)
	(21.216954406171141 -12.130292415618896 21.189438343048096)
	(21.216954406171141 139.49590752395216 21.189438343048096)
	(20.216954406171141 139.49590752395216 21.189438343048096)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (1 30 4) 
simpleGrading (
	1.0
	(
		(0.1 20.0 1.0)
		(0.45 60.0 1.0)
		(0.55 20.0 1.0)
	)
	(
		(0.5 70.0 1.0)
		(0.5 30.0 1.0)
	)
	)
);

edges
(
);

boundary
(   leftSide
   {
       type empty;
       faces
       (       
	(3 0 4 7)
       );
   }

   rightSide
   {
       type empty;
       faces
       (       
	(1 2 6 5)
       );
   }

   outlet
   {
       type patch;
       faces
       (       
	(2 3 7 6)
       );
   }

   top
   {
       type patch;
       faces
       (       
	(4 5 6 7)
       );
   }

   ground
   {
       type wall;
       faces
       (       
	(3 2 1 0)
       );
   }

   inlet
   {
       type patch;
       faces
       (       
	(0 1 5 4)
       );
   }
);

mergePatchPair
(
);
