etc/OpenFOAM_sample_files/outdoor_airflow_2d/0/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/

Uref		6.0;

Zref		10;

z0		uniform 1.0;

flowDir		(0.0 1.0 0.0);

zDir		(0 0 1);

zGround		uniform 0.0;

value		$internalField;