etc/OpenFOAM_sample_files/outdoor_airflow_2d/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		k;
}

dimensions		[0 2 -2 0 0 0 0];

#include		"initialConditions";

internalField		uniform $turbulentKE;

boundaryField
{

    leftSide
    {

        type		empty;

    }

    rightSide
    {

        type		empty;

    }

    outlet
    {

        type		inletOutlet;

        inletValue		uniform $turbulentKE;

        value		$internalField;

    }

    top
    {

        type		slip;

    }

    ground
    {

        type		zeroGradient;

    }

    buildings
    {

        type		kqRWallFunction;

        value		$internalField;

    }

    inlet
    {

        type		atmBoundaryLayerInletK;

        #include		"ABLConditions";

    }

}