etc/OpenFOAM_sample_files/outdoor_airflow_2d/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		nut;
}

dimensions		[0 2 -1 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    leftSide
    {

        type		empty;

    }

    rightSide
    {

        type		empty;

    }

    outlet
    {

        type		calculated;

        value		uniform 0;

    }

    top
    {

        type		calculated;

        value		uniform 0;

    }

    ground
    {

        type		nutkAtmRoughWallFunction;

        #include		"ABLConditions";

        value		uniform 0;

    }

    buildings
    {

        type		nutkWallFunction;

        value		uniform 0.0;

    }

    inlet
    {

        type		calculated;

        value		uniform 0;

    }

}