etc/OpenFOAM_sample_files/outdoor_airflow_2d/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
}

solvers
{

    p
    {

        agglomerator		faceAreaPair;

        relTol		0.1;

        tolerance		1e-7;

        nCellsInCoarsestLevel		10;

        smoother		GaussSeidel;

        solver		GAMG;

        cacheAgglomeration		on;

        nPostSweeps		2;

        nPreSweepsre		0;

        mergeLevels		1;

    }

    U
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    k
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    epsilon
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

}

SIMPLE
{

    nNonOrthogonalCorrectors		2;

    residualControl
    {

        nut		0.0001;

        k		0.0001;

        U		0.0001;

        epsilon		0.0001;

        p		0.0001;

    }

}

relaxationFactors
{

    k		0.7;

    U		0.7;

    epsilon		0.7;

    p		0.3;

}